index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-02-23 Tue 17:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cs</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tomaz GdA" />
<link rel="stylesheet" type="text/css" href="org.css" />
</head>
<body>
<div id="content">
<h1 class="title">Cs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9a773fc">Hello World</a></li>
<li><a href="#orgbeb9d32">Exercise 11</a></li>
<li><a href="#org7612699">Exercise 12</a></li>
<li><a href="#orge301a4c">Exercise 13</a></li>
<li><a href="#org79a000f">Exercise 14</a></li>
<li><a href="#org94bd01a">Exercise 24</a></li>
<li><a href="#org59bceff">Exercise 25 Times tables</a></li>
<li><a href="#orgf07f7d6">Exercise 26</a></li>
<li><a href="#orgf6f0a4d">Exercise 27</a></li>
<li><a href="#org6363f80">Exercise 28</a></li>
<li><a href="#orgfbe7f43"><span class="todo TODO">TODO</span> Quiz.py</a>
<ul>
<li>
<ul>
<li><a href="#orgf493df9">Example</a></li>
<li><a href="#orge37b344"><span class="todo TODO">TODO</span> Functions (W.I.P)</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga76759f">Rock Paper Scissors Game</a></li>
<li><a href="#org03a451a">Python Extension Exercises - Part 2</a>
<ul>
<li><a href="#org7f0294d">Creating a program which asks the user to type in a a sort</a></li>
<li><a href="#orga08d78f">Create a program which asks the user to input two integers (store these values in two variables called x and y) and a mathematical operator (+, -, / or *) and store this in a variable called operator.</a></li>
<li><a href="#org0f44d32">Create a program which asks the user to enter an amount in £ - store this value in a variable called amount.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9a773fc" class="outline-2">
<h2 id="org9a773fc">Hello World</h2>
<div class="outline-text-2" id="text-org9a773fc">
<p>
Prints hello world to the screen.
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Hello, world!"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-orgbeb9d32" class="outline-2">
<h2 id="orgbeb9d32">Exercise 11</h2>
<div class="outline-text-2" id="text-orgbeb9d32">
<p>
Asks user to enter name, records user input, prints that input (name).
</p>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">'enter your name'</span>)
<span style="color: #00538b;">name</span> = <span style="color: #8f0075;">input</span>()
<span style="color: #5317ac;">print</span>(name)

</pre>
</div>
</div>
</div>

<div id="outline-container-org7612699" class="outline-2">
<h2 id="org7612699">Exercise 12</h2>
<div class="outline-text-2" id="text-org7612699">
<ol class="org-ol">
<li>The issue with this program is that the user can input any value that is not &rsquo;Yes&rsquo; and sill get the message stating they will get wet.</li>
<li>&ldquo;If it rains, you will stay dry&rdquo;</li>
<li>[Discussed in question. 1]</li>
</ol>
</div>
</div>

<div id="outline-container-orge301a4c" class="outline-2">
<h2 id="orge301a4c">Exercise 13</h2>
<div class="outline-text-2" id="text-orge301a4c">
<ol class="org-ol">
<li>&ldquo;you are a woman&rdquo;</li>
<li>&ldquo;you are not allowed in the sixth form cafe&rdquo;</li>
<li>&ldquo;incorrect password&rdquo;</li>
</ol>
</div>
</div>

<div id="outline-container-org79a000f" class="outline-2">
<h2 id="org79a000f">Exercise 14</h2>
<div class="outline-text-2" id="text-org79a000f">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"what is your name?"</span>)
<span style="color: #00538b;">name</span> = <span style="color: #8f0075;">input</span>(
<span style="color: #5317ac;">if</span> name == <span style="color: #2544bb;">"Tom"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"hello Tom"</span>)
<span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Where is Tom?"</span>)

</pre>
</div>
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"do you like hot weather?"</span>)
<span style="color: #00538b;">ans</span> = <span style="color: #8f0075;">input</span>()
<span style="color: #5317ac;">if</span> <span style="color: #00538b;">ans</span> == <span style="color: #2544bb;">"Yes"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"go to the beach"</span>)
<span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Go somewhere cool on holiday... Like Finland."</span>)

</pre>
</div>
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"do you like milk?"</span>)
<span style="color: #00538b;">ans</span> = <span style="color: #8f0075;">input</span>()
<span style="color: #5317ac;">if</span> <span style="color: #00538b;">ans</span> == <span style="color: #2544bb;">"Yes"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"That is great, it is a good source of calcium"</span>)
<span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>()

</pre>
</div>
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"how old are you?"</span>)
<span style="color: #00538b;">ans</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())
<span style="color: #5317ac;">if</span> ans &gt;= <span style="color: #0000c0;">14</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"you are doing GCSEs"</span>)
<span style="color: #5317ac;">elif</span> ans &lt; <span style="color: #0000c0;">14</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"you are not doing GCSEs"</span>)
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"do you enjoy creative subjects?"</span>)
    <span style="color: #00538b;">ans2</span> = <span style="color: #8f0075;">input</span>()
    <span style="color: #5317ac;">if</span> <span style="color: #00538b;">ans2</span> == <span style="color: #2544bb;">"Yes"</span>:
        <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Maybe you should think about Art or Music?"</span>)
    <span style="color: #5317ac;">else</span>:
        <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Maybe you should think about Computing?"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-org94bd01a" class="outline-2">
<h2 id="org94bd01a">Exercise 24</h2>
<div class="outline-text-2" id="text-org94bd01a">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"enter an end value"</span>)
<span style="color: #00538b;">end</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())

<span style="color: #5317ac;">for</span> counter <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span> (<span style="color: #0000c0;">0</span>,end):
    <span style="color: #5317ac;">print</span>(counter)

</pre>
</div>

<p>
It will ask the user to enter a value. It will then print every number between 0 (including 0) and 1 less than that number.
</p>
</div>
</div>

<div id="outline-container-org59bceff" class="outline-2">
<h2 id="org59bceff">Exercise 25 Times tables</h2>
<div class="outline-text-2" id="text-org59bceff">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"enter an end value"</span>)
<span style="color: #00538b;">num</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"enter how many times tables do you wish for?"</span>)
<span style="color: #00538b;">max_count</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())
<span style="color: #00538b;">count</span> = <span style="color: #0000c0;">0</span>

<span style="color: #5317ac;">for</span> counter <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span> (<span style="color: #0000c0;">0</span>,max_count):
    <span style="color: #5317ac;">print</span>(count, <span style="color: #2544bb;">"times"</span>, num, <span style="color: #2544bb;">"is"</span>, (count * num))
    <span style="color: #00538b;">count</span> += <span style="color: #0000c0;">1</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgf07f7d6" class="outline-2">
<h2 id="orgf07f7d6">Exercise 26</h2>
<div class="outline-text-2" id="text-orgf07f7d6">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #00538b;">pocketMoney</span> = <span style="color: #0000c0;">0.01</span>
<span style="color: #5317ac;">for</span> week <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span>(<span style="color: #0000c0;">10</span>):
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"It is week "</span>,week)
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"You will get &#163; "</span>,pocketMoney)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5317ac;">for</span> week <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span>(<span style="color: #0000c0;">1</span>,<span style="color: #0000c0;">26</span>):
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf6f0a4d" class="outline-2">
<h2 id="orgf6f0a4d">Exercise 27</h2>
<div class="outline-text-2" id="text-orgf6f0a4d">
<p>
Asks the user to enter a password until it matches &ldquo;thepassword&rdquo;.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #5317ac;">print</span>(&#8220;Enter your password&#8221;)
<span style="color: #00538b;">password</span> = <span style="color: #8f0075;">input</span>()
<span style="color: #5317ac;">while</span> password != &#8220;thepassword&#8221;:
    <span style="color: #5317ac;">print</span>(&#8220;incorrect password, <span style="color: #5317ac;">try</span> again&#8221;)
    <span style="color: #00538b;">password</span> = <span style="color: #8f0075;">input</span>()
</pre>
</div>

<p>
A while loops executes the instruction within the loop until a requirement is met.
</p>
</div>
</div>

<div id="outline-container-org6363f80" class="outline-2">
<h2 id="org6363f80">Exercise 28</h2>
<div class="outline-text-2" id="text-org6363f80">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span> (<span style="color: #2544bb;">"enter your name"</span>)
<span style="color: #00538b;">name</span> = <span style="color: #8f0075;">input</span> ()
<span style="color: #5317ac;">while</span> name != <span style="color: #2544bb;">"Tomaz"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"wrong name try again"</span>)
<span style="color: #00538b;">name</span> = <span style="color: #8f0075;">input</span>()

</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #00538b;">totalValue</span> = <span style="color: #0000c0;">0</span>
<span style="color: #00538b;">newValue</span> = <span style="color: #0000c0;">0</span>
<span style="color: #5317ac;">while</span> totalValue &lt; <span style="color: #0000c0;">100</span>:
    <span style="color: #5317ac;">print</span> (<span style="color: #2544bb;">"how much are you putting in your piggy bank?&#8221;)</span>
<span style="color: #2544bb;">    newValue = int(input())</span>
<span style="color: #2544bb;">    totalValue = totalValue+newValue</span>
<span style="color: #2544bb;">    newValue = 0</span>
<span style="color: #2544bb;">    print (totalValue)</span>

</pre>
</div>
</div>
</div>
