index.html

<div id="outline-container-orgfbe7f43" class="outline-2">
<h2 id="orgfbe7f43"><span class="todo TODO">TODO</span> Quiz.py</h2>
<div class="outline-text-2" id="text-orgfbe7f43">
</div>
<div id="outline-container-orgf493df9" class="outline-4">
<h4 id="orgf493df9">Example</h4>
<div class="outline-text-4" id="text-orgf493df9">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Welcome to my Quiz"</span>)
<span style="color: #00538b;">score</span> = <span style="color: #0000c0;">0</span>

<span style="color: #00538b;">questNum</span>=<span style="color: #0000c0;">1</span>
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Question number"</span>,questNum)
<span style="color: #00538b;">answer</span>=<span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>(<span style="color: #2544bb;">"What is 2**7? "</span>))
<span style="color: #5317ac;">if</span> <span style="color: #00538b;">answer</span>==<span style="color: #0000c0;">128</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Yes!!"</span>)
    <span style="color: #00538b;">score</span>=score+<span style="color: #0000c0;">1</span>
<span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"No!"</span>)

</pre>
</div>
</div>
</div>

<div id="outline-container-orge37b344" class="outline-4">
<h4 id="orge37b344"><span class="todo TODO">TODO</span> Functions (W.I.P)</h4>
<div class="outline-text-4" id="text-orge37b344">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Welcome to my Quiz"</span>)
<span style="color: #00538b;">score</span> = <span style="color: #0000c0;">0</span>
<span style="color: #5317ac;">def</span> <span style="color: #721045;">quiz</span>(question_number):
    <span style="color: #5317ac;">for</span> i <span style="color: #5317ac;">in</span> <span style="color: #8f0075;">range</span>(<span style="color: #0000c0;">3</span>):
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"-"</span>)
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Question number"</span>, question_number)

<span style="color: #5317ac;">def</span> <span style="color: #721045;">qOne</span>():
    <span style="color: #5317ac;">global</span> score
    quiz(<span style="color: #0000c0;">1</span>)
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"What is 2**7?"</span>)
    <span style="color: #00538b;">answer</span>=<span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())
    <span style="color: #5317ac;">if</span> <span style="color: #00538b;">answer</span>==<span style="color: #0000c0;">128</span>:
        <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Yes!!"</span>)
        <span style="color: #00538b;">score</span> = score + <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">else</span>:
        <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"No!"</span>)

<span style="color: #5317ac;">def</span> <span style="color: #721045;">qTwo</span>():
  <span style="color: #5317ac;">global</span> score
  quiz(<span style="color: #0000c0;">2</span>)
  <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"What is 5*5?"</span>)
  <span style="color: #00538b;">answer</span>=<span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())
  <span style="color: #5317ac;">if</span> <span style="color: #00538b;">answer</span>==<span style="color: #0000c0;">25</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Yes"</span>)
    <span style="color: #00538b;">score</span> = score + <span style="color: #0000c0;">1</span>
  <span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"No"</span>)

<span style="color: #5317ac;">def</span> <span style="color: #721045;">qThree</span>():
  <span style="color: #5317ac;">global</span> score
  quiz(<span style="color: #0000c0;">3</span>)


<span style="color: #5317ac;">def</span> <span style="color: #721045;">gameStart</span>():
    qOne()
    qTwo()
    qThree()

gameStart()

</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orga76759f" class="outline-2">
<h2 id="orga76759f">Rock Paper Scissors Game</h2>
<div class="outline-text-2" id="text-orga76759f">
<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">import</span> random

<span style="color: #00538b;">usrScore</span> = <span style="color: #0000c0;">0</span>
<span style="color: #00538b;">comScore</span> = <span style="color: #0000c0;">0</span>
<span style="color: #00538b;">GameEnd</span> = <span style="color: #5317ac;">False</span>

<span style="color: #00538b;">choices</span> = [<span style="color: #2544bb;">"R"</span>, <span style="color: #2544bb;">"P"</span>, <span style="color: #2544bb;">"S"</span>]

<span style="color: #5317ac;">def</span> <span style="color: #721045;">rock</span>():
   <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"""</span>
<span style="color: #2544bb;">      _______</span>
<span style="color: #2544bb;">   ---'   ____)</span>
<span style="color: #2544bb;">         (_____)</span>
<span style="color: #2544bb;">         (_____)</span>
<span style="color: #2544bb;">         (____)</span>
<span style="color: #2544bb;">   ---.__(___)</span>
<span style="color: #2544bb;">  """</span>)

<span style="color: #5317ac;">def</span> <span style="color: #721045;">paper</span>():
   <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"""</span>
<span style="color: #2544bb;">        _______</span>
<span style="color: #2544bb;">  ---'      ____)____</span>
<span style="color: #2544bb;">               ______)</span>
<span style="color: #2544bb;">             _______)</span>
<span style="color: #2544bb;">            _______)</span>
<span style="color: #2544bb;">  ---.__________)</span>
<span style="color: #2544bb;">  """</span>)

<span style="color: #5317ac;">def</span> <span style="color: #721045;">scissors</span>():
   <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"""</span>
<span style="color: #2544bb;">       _______</span>
<span style="color: #2544bb;">   ---'   ____)____</span>
<span style="color: #2544bb;">            ______)</span>
<span style="color: #2544bb;">         __________)</span>
<span style="color: #2544bb;">         (____)</span>
<span style="color: #2544bb;">   ---.__(___)</span>
<span style="color: #2544bb;">  """</span>)



<span style="color: #5317ac;">def</span> <span style="color: #721045;">rAs</span>():
   rock()
   scissors()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">rAp</span>():
   rock()
   paper()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">rAr</span>():
   rock()
   rock()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">pAr</span>():
   paper()
   rock()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">pAp</span>():
   paper()
   paper()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">pAs</span>():
   paper()
   scissors()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">sAr</span>():
   scissors()
   rock()
<span style="color: #5317ac;">def</span> <span style="color: #721045;">sAp</span>():
    scissors()
    paper()

<span style="color: #5317ac;">def</span> <span style="color: #721045;">sAs</span>():
   scissors()
   scissors()

<span style="color: #5317ac;">while</span> <span style="color: #00538b;">GameEnd</span> == <span style="color: #5317ac;">False</span>:

  <span style="color: #5317ac;">if</span> comScore &gt;= <span style="color: #0000c0;">5</span>:
   <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"com win"</span>)
   <span style="color: #00538b;">GameEnd</span> = <span style="color: #5317ac;">True</span>
  <span style="color: #5317ac;">elif</span> usrScore &gt;= <span style="color: #0000c0;">5</span>:
   <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"usr win"</span>)
   <span style="color: #00538b;">GameEnd</span> = <span style="color: #5317ac;">True</span>
  <span style="color: #5317ac;">else</span>:
    <span style="color: #00538b;">usrInput</span> = <span style="color: #8f0075;">input</span>(<span style="color: #2544bb;">"Rock, Paper, Scissors : R, P, S"</span>)
    <span style="color: #00538b;">comInput</span> = random.choice(choices)
    <span style="color: #5317ac;">print</span>(comInput)
    <span style="color: #5317ac;">if</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"R"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"R"</span>:
      rAr()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"draw"</span>)
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"R"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"P"</span>:
      rAp()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"player loose"</span>)
      <span style="color: #00538b;">comScore</span> += <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"R"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"S"</span>:
      rAs()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"player win"</span>)
      <span style="color: #00538b;">usrScore</span> += <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"P"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"R"</span>:
      pAr()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"player win"</span>)
      <span style="color: #00538b;">usrScore</span> += <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"P"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"P"</span>:
      pAp()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"draw"</span>)
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"P"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"S"</span>:
      pAs()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"player loose"</span>)
      <span style="color: #00538b;">comScore</span> += <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"S"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"R"</span>:
      sAr()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"player loose"</span>)
      <span style="color: #00538b;">comScore</span> += <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"S"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"P"</span>:
      sAp()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"player win"</span>)
      <span style="color: #00538b;">usrScore</span> += <span style="color: #0000c0;">1</span>
    <span style="color: #5317ac;">elif</span> <span style="color: #00538b;">usrInput</span> == <span style="color: #2544bb;">"S"</span> <span style="color: #5317ac;">and</span> <span style="color: #00538b;">comInput</span> == <span style="color: #2544bb;">"S"</span>:
      sAs()
      <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"draw"</span>)

</pre>
</div>
</div>
</div>
