index.html



<div id="outline-container-org03a451a" class="outline-2">
<h2 id="org03a451a">Python Extension Exercises - Part 2</h2>
<div class="outline-text-2" id="text-org03a451a">
</div>
<div id="outline-container-org7f0294d" class="outline-3">
<h3 id="org7f0294d">Creating a program which asks the user to type in a a sort</h3>
<div class="outline-text-3" id="text-org7f0294d">
<ol class="org-ol">
<li>Assign this value to a variable called sport.</li>
<li>If the sport is football, output &ldquo;The beautiful game&rdquo;</li>
<li>If the sport is ice hockey, output &ldquo;The violent game&rdquo;</li>
<li>If the sport is rugby, output &ldquo;The game of egg chasers&rdquo;</li>
<li>If the sport is basketball, output &ldquo;Netball for men&rdquo;</li>
<li>Else output &ldquo;what sport do you like then&rdquo;</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #00538b;">sport</span> = <span style="color: #8f0075;">input</span>(<span style="color: #2544bb;">"Type in a sport: "</span>)

<span style="color: #5317ac;">if</span> <span style="color: #00538b;">sport</span> == <span style="color: #2544bb;">"football"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"The beautiful game"</span>)
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">sport</span> == <span style="color: #2544bb;">"ice hockey"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"The violent game"</span>)
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">sport</span> == <span style="color: #2544bb;">"rugby"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"The game of egg chasers"</span>)
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">sport</span> == <span style="color: #2544bb;">"basketball"</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"Netball for men"</span>)
<span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"What sport do you like then"</span>)


</pre>
</div>
</div>
</div>


<div id="outline-container-orga08d78f" class="outline-3">
<h3 id="orga08d78f">Create a program which asks the user to input two integers (store these values in two variables called x and y) and a mathematical operator (+, -, / or *) and store this in a variable called operator.</h3>
<div class="outline-text-3" id="text-orga08d78f">
<ol class="org-ol">
<li>IF the operator is a + symbol, output the value of x + y</li>
<li>IF the operator is a - symbol, output the value of x - y</li>
<li>IF the operator is a * symbol, output the value of x * y</li>
<li>ELSE output the value of x / y</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"enter x"</span>)
<span style="color: #00538b;">x</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())

<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"enter y"</span>)
<span style="color: #00538b;">y</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())

<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"enter an operator, + - * or / only"</span>)
<span style="color: #00538b;">operator</span> = <span style="color: #8f0075;">input</span>()

<span style="color: #5317ac;">if</span> <span style="color: #00538b;">operator</span> == <span style="color: #2544bb;">"+"</span>:
    <span style="color: #5317ac;">print</span>(x, <span style="color: #2544bb;">"+"</span>, y, <span style="color: #2544bb;">"="</span>, x+y)
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">operator</span> == <span style="color: #2544bb;">"-"</span>:
    <span style="color: #5317ac;">print</span>(x, <span style="color: #2544bb;">"+"</span>, y, <span style="color: #2544bb;">"="</span>, x-y)
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">operator</span> == <span style="color: #2544bb;">"*"</span>:
    <span style="color: #5317ac;">print</span>(x, <span style="color: #2544bb;">"*"</span>, y, <span style="color: #2544bb;">"="</span>, x*y)
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">operator</span> == <span style="color: #2544bb;">"/"</span>:
    <span style="color: #5317ac;">print</span>(x, <span style="color: #2544bb;">"/"</span>, y, <span style="color: #2544bb;">"="</span>, x/y)

</pre>
</div>
</div>
</div>


<div id="outline-container-org0f44d32" class="outline-3">
<h3 id="org0f44d32">Create a program which asks the user to enter an amount in £ - store this value in a variable called amount.</h3>
<div class="outline-text-3" id="text-org0f44d32">
<ol class="org-ol">
<li>Ask the user for a currency to exchange the amount to ($, Yen, Euros or NZ $) – store this in a variables called exchange.</li>
<li>IF the exchange variable is $ then output the amount multiplied by 1.5</li>
<li>IF the exchange variable is Yen then output the amount multiplied by 20</li>
<li>IF the exchange variable is Euros then output the amount multiplied by 1.3</li>
<li>IF the exchange variable is NZ $ then output the amount multiplied by 2</li>
<li>ELSE output “we don’t exchange this currency”</li>
</ol>

<div class="org-src-container">
<pre class="src src-python">
<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"ENTER AMOUNT IN POUNDS"</span>)
<span style="color: #00538b;">poundValue</span> = <span style="color: #8f0075;">int</span>(<span style="color: #8f0075;">input</span>())

<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"WHICH CURRENCY DO YOU WISH TO CONVERT TO"</span>)
<span style="color: #00538b;">currency</span> = <span style="color: #8f0075;">input</span>(<span style="color: #2544bb;">"ENTER Dollar, Yen, Euro, or NZ"</span>)

<span style="color: #5317ac;">if</span> <span style="color: #00538b;">currency</span> == <span style="color: #2544bb;">"Dollar"</span>:
    <span style="color: #00538b;">op</span> = <span style="color: #0000c0;">1.5</span>
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">currency</span> == <span style="color: #2544bb;">"Yen"</span>:
    <span style="color: #00538b;">op</span> = <span style="color: #0000c0;">20</span>
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">currency</span> == <span style="color: #2544bb;">"Euro"</span>:
    <span style="color: #00538b;">op</span> = <span style="color: #0000c0;">1.3</span>
<span style="color: #5317ac;">elif</span> <span style="color: #00538b;">currency</span> == <span style="color: #2544bb;">"NZ"</span>:
    <span style="color: #00538b;">op</span> = <span style="color: #0000c0;">2</span>
<span style="color: #5317ac;">else</span>:
    <span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"We don't trade this currency"</span>)


<span style="color: #5317ac;">print</span>(<span style="color: #2544bb;">"YOUR NEW BALANCE IS: "</span>, poundValue * op)



</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tomaz GdA</p>
<p class="date">Created: 2021-02-23 Tue 17:00</p>
</div>
</body>
</html>
